[
  {
    "word": "dubious",
    "pos": "adj.",
    "meaning_cn": "不可靠的，可疑的",
    "definition": "not to be relied upon",
    "example": "These claims are dubious and not scientifically proven."
  },
  {
    "word": "yearn",
    "pos": "vi.",
    "meaning_cn": "怀念，渴望",
    "definition": "have an intense feeling of loss or lack and longing for something",
    "example": "They yearned to go home."
  },
  {
    "word": "litter",
    "pos": "vt. & n.",
    "meaning_cn": "充斥着；一窝",
    "definition": "1. fill (a text, history, etc.) with examples of something unpleasant 2. a number of young animals born to an animal at one time",
    "example": "1. The book is littered with errors. 2. A feline litter usually consists of two to five kittens."
  },
  {
    "word": "brood",
    "pos": "n.",
    "meaning_cn": "一窝雏鸟",
    "definition": "a group of young birds all born at the same time",
    "example": "The blackbird flew back and forth to its brood."
  },
  {
    "word": "disdain",
    "pos": "vt.",
    "meaning_cn": "鄙视，蔑视",
    "definition": "consider to be unworthy of one's consideration",
    "example": "The older musicians disdain the new, rock-influenced music."
  },
  {
    "word": "demographic",
    "pos": "adj.",
    "meaning_cn": "人口结构的",
    "definition": "relating to the structure of populations",
    "example": "The demographic trend is towards an older population."
  },
  {
    "word": "recession",
    "pos": "n.",
    "meaning_cn": "经济衰退",
    "definition": "a period of temporary economic decline during which trade and industrial activity are reduced",
    "example": "Many people lost their jobs during the recent recession."
  },
  {
    "word": "bust",
    "pos": "n.",
    "meaning_cn": "经济萧条时期",
    "definition": "a period of economic difficulty or depression",
    "example": "The boom was followed by the present bust."
  },
  {
    "word": "proxy",
    "pos": "n.",
    "meaning_cn": "代理人",
    "definition": "a person who is given the power or authority to do something for someone else",
    "example": "Since I wouldn't be available to vote, I nominated him to act as my proxy."
  },
  {
    "word": "genome",
    "pos": "n.",
    "meaning_cn": "基因组",
    "definition": "the complete set of genetic material of a human, animal, plant, or other living thing",
    "example": "However, genome duplication alone is insufficient to develop complex biochemical pathways or novel cell structures."
  },
  {
    "word": "envision",
    "pos": "vt.",
    "meaning_cn": "想象；展望",
    "definition": "imagine as a future possibility; visualize",
    "example": "She envisioned the admiring glances of guests seeing her home."
  },
  {
    "word": "deliver",
    "pos": "vt.",
    "meaning_cn": "解救，释放",
    "definition": "save, rescue, or set someone or something free from",
    "example": "He delivered us from the nightmare of junk paper."
  },
  {
    "word": "versatile",
    "pos": "adj.",
    "meaning_cn": "多功能的，多才多艺的",
    "definition": "able to adapt or be adapted to many different functions or activities",
    "example": "He was versatile enough to play on either wing."
  },
  {
    "word": "solicit",
    "pos": "vt.",
    "meaning_cn": "请求，乞求",
    "definition": "to ask someone for money, information, or help",
    "example": "It is illegal for public officials to solicit gifts or money in exchange for favours."
  },
  {
    "word": "be littered with",
    "pos": "phrase",
    "meaning_cn": "布满，到处都是",
    "definition": "have or contain a lot of that thing",
    "example": "The newspaper has a reputation for being littered with spelling mistakes."
  },
  {
    "word": "thwart",
    "pos": "vt.",
    "meaning_cn": "反对；阻挠；挫败",
    "definition": "to stop something from happening or someone from doing something",
    "example": "Our holiday plans were thwarted by the airline pilots' strike."
  },
  {
    "word": "bequeath",
    "pos": "vt.",
    "meaning_cn": "将个人财产遗赠给",
    "definition": "leave (a personal estate or one's body) to a person or other beneficiary by a will",
    "example": "Picasso bequeathed most of his paintings and sculptures to Spain and France."
  },
  {
    "word": "conceited",
    "pos": "adj.",
    "meaning_cn": "自负的，骄傲自满的",
    "definition": "excessively proud of oneself; vain",
    "example": "Without wishing to sound conceited, I am the best salesperson in the company."
  },
  {
    "word": "penal",
    "pos": "adj.",
    "meaning_cn": "刑罚有关的",
    "definition": "of or relating to punishment given by law",
    "example": "He had been in and out of penal institutions from the age of 16."
  },
  {
    "word": "sham",
    "pos": "vi. & vt.",
    "meaning_cn": "假装",
    "definition": "to pretend",
    "example": "He isn't really upset—he's just shamming."
  },
  {
    "word": "augment",
    "pos": "vt.",
    "meaning_cn": "提高，增大，加强",
    "definition": "to increase the value, amount, effectiveness etc of something",
    "example": "He would have to find work to augment his income."
  },
  {
    "word": "endorsement",
    "pos": "n.",
    "meaning_cn": "背书，赞同，认可",
    "definition": "the act of saying that you approve of or support something or someone",
    "example": "The campaign hasn't received any political endorsements."
  },
  {
    "word": "preside",
    "pos": "vi.",
    "meaning_cn": "主持",
    "definition": "to be in charge of a formal meeting, ceremony, or trial",
    "example": "Who would be the best person to preside at/over the public enquiry?"
  },
  {
    "word": "pervade",
    "pos": "vt.",
    "meaning_cn": "渗透，弥漫，充满",
    "definition": "When qualities, characteristics, or smells pervade a place or thing, they spread through it and are present in every part of it.",
    "example": "The film movie is a reflection of the violence that pervades our culture."
  },
  {
    "word": "entreat",
    "pos": "vt.",
    "meaning_cn": "恳求，乞求",
    "definition": "to try very hard to persuade someone to do something",
    "example": "We would spend every meal time entreating the child to eat her vegetables."
  },
  {
    "word": "coerce",
    "pos": "vt.",
    "meaning_cn": "强迫，胁迫",
    "definition": "to persuade someone forcefully to do something that they are unwilling to do",
    "example": "The court heard that the six defendants had been coerced into making a confession."
  },
  {
    "word": "aggregate",
    "pos": "n.",
    "meaning_cn": "总数，合计",
    "definition": "something formed by adding together several amounts or things",
    "example": "Arsenal lost the second game, but got through to the final on aggregate."
  },
  {
    "word": "smudge",
    "pos": "vt.",
    "meaning_cn": "弄脏，涂污",
    "definition": "cause (something) to become messily smeared by rubbing it",
    "example": "She dabbed her eyes, careful not to smudge her make-up."
  },
  {
    "word": "superior",
    "pos": "adj.",
    "meaning_cn": "更好的，更优的",
    "definition": "better than average or better than other people or things of the same type",
    "example": "For babies, breastfeeding is superior to bottle-feeding."
  },
  {
    "word": "take issue with",
    "pos": "phrase",
    "meaning_cn": "持强烈异议，很不赞同",
    "definition": "to disagree strongly",
    "example": "I took issue with him over his interpretation of the instructions."
  },
  {
    "word": "revenue",
    "pos": "n.",
    "meaning_cn": "收入，收益",
    "definition": "income, especially when of a company or organization and of a substantial nature",
    "example": "Taxes provide most of the government's revenue."
  },
  {
    "word": "gauge",
    "pos": "vt.",
    "meaning_cn": "判断，猜测",
    "definition": "form a judgement or estimate of (a situation, mood, etc.)",
    "example": "She is unable to gauge his mood."
  },
  {
    "word": "disseminate",
    "pos": "vt.",
    "meaning_cn": "散布，传播",
    "definition": "spread or disperse (something, especially information) widely",
    "example": "The purpose of a university press is to disseminate knowledge by publishing books and journals."
  },
  {
    "word": "supremacy",
    "pos": "n.",
    "meaning_cn": "至高无上，最高地位",
    "definition": "the state or condition of being superior to all others in authority, power, or status",
    "example": "By the end of the war, the prince had established total supremacy over all his rivals."
  },
  {
    "word": "deter",
    "pos": "vt.",
    "meaning_cn": "恐吓；阻止",
    "definition": "discourage (someone) from doing something, typically by instilling doubt or fear of the consequences",
    "example": "Some potential buyers will be deterred by the price."
  },
  {
    "word": "deteriorate",
    "pos": "vi.",
    "meaning_cn": "不断恶化",
    "definition": "become progressively worse",
    "example": "She was taken into hospital last week when her condition suddenly deteriorated."
  },
  {
    "word": "laden",
    "pos": "adj.",
    "meaning_cn": "装满的，有负载的",
    "definition": "heavily loaded or weighed down",
    "example": "He always comes back from France laden with presents for everyone."
  },
  {
    "word": "benchmark",
    "pos": "vt.",
    "meaning_cn": "评估，衡量，检测",
    "definition": "evaluate or check (something) by comparison with a standard",
    "example": "We are benchmarking our performance against external criteria."
  },
  {
    "word": "posterity",
    "pos": "n.",
    "meaning_cn": "后代",
    "definition": "all future generations of people",
    "example": "The victims' names are recorded for posterity."
  },
  {
    "word": "pledge",
    "pos": "vi.",
    "meaning_cn": "承诺",
    "definition": "solemnly undertake to do something",
    "example": "They pledged to continue the campaign for funding."
  },
  {
    "word": "trample",
    "pos": "vi.",
    "meaning_cn": "不顾，忽略，藐视",
    "definition": "to act without any respect for someone or something",
    "example": "She accused the government of trampling on the needs and rights of the ordinary citizen."
  },
  {
    "word": "concede",
    "pos": "vt.",
    "meaning_cn": "承认，同意",
    "definition": "admit or agree that something is true or valid after first denying or resisting it",
    "example": "That principle now seems to have been conceded."
  }
]