[
  {
    "word": "legitimate",
    "pos": "adj.",
    "meaning_cn": "正当合理的，合情合理的",
    "definition": "for which there is a fair and acceptable reason",
    "example": "Politicians are legitimate targets for satire."
  },
  {
    "word": "bountiful",
    "pos": "adj.",
    "meaning_cn": "大量的，巨大的",
    "definition": "in large quantities; large",
    "example": "State aid is less bountiful than it was before."
  },
  {
    "word": "benevolent",
    "pos": "adj.",
    "meaning_cn": "（尤指当权者）慈善的，仁慈的",
    "definition": "kind, helpful and generous",
    "example": "The company has proved to be a most benevolent employer."
  },
  {
    "word": "confine",
    "pos": "vt.",
    "meaning_cn": "限制，限定",
    "definition": "to keep someone or something inside the limits of a particular activity, subject, area, etc.",
    "example": "The work will not be confined to the Glasgow area."
  },
  {
    "word": "ascribe",
    "pos": "vt.",
    "meaning_cn": "把…归因于，认为…是由于",
    "definition": "to consider that something is caused by a particular thing or person",
    "example": "He ascribed his failure to bad luck."
  },
  {
    "word": "inverse correlation",
    "pos": "phrase",
    "meaning_cn": "负相关，反相关",
    "definition": "a correlation in which large values of one variable are associated with small values of the other; the correlation coefficient is between 0 and -1",
    "example": ""
  },
  {
    "word": "null",
    "pos": "adj.",
    "meaning_cn": "零值的，等于零的",
    "definition": "having the value zero",
    "example": "A spokeswoman said the agreement had been declared null and void."
  },
  {
    "word": "rebuttal",
    "pos": "n.",
    "meaning_cn": "反驳",
    "definition": "a statement that says that something is not true",
    "example": "She issued a point-by-point rebuttal of the company's accusations."
  },
  {
    "word": "roam",
    "pos": "vt. & vi.",
    "meaning_cn": "漫游",
    "definition": "to move about or travel, especially without a clear idea of what you are going to do",
    "example": "After the bars close, gangs of youths roam the city streets."
  },
  {
    "word": "eject",
    "pos": "vt.",
    "meaning_cn": "（用武力）驱逐，逐出，赶出",
    "definition": "to force someone to leave a particular place",
    "example": "A number of fans had been ejected from the bar for causing trouble."
  },
  {
    "word": "dim",
    "pos": "adj.",
    "meaning_cn": "光线暗的，暗淡的，昏暗的",
    "definition": "not giving or having much light",
    "example": "We could see a dim shape in the fog."
  },
  {
    "word": "proposition",
    "pos": "n.",
    "meaning_cn": "主张，观点，见解",
    "definition": "an idea or opinion",
    "example": "They were debating the proposition that \"All people are created equal\"."
  },
  {
    "word": "cripple",
    "pos": "vt.",
    "meaning_cn": "严重损坏，使瘫痪",
    "definition": "cause a severe and almost insuperable problem for",
    "example": "Developing countries are crippled by their debts."
  },
  {
    "word": "trial and error",
    "pos": "phrase",
    "meaning_cn": "反复试验、试错法",
    "definition": "a way of achieving an aim or solving a problem by trying a number of different methods and learning from mistakes",
    "example": "There's no instant way of finding a cure - it's just a process of trial and error."
  },
  {
    "word": "generalization",
    "pos": "n.",
    "meaning_cn": "通过归纳得出的普遍、笼统的观点",
    "definition": "a written or spoken statement in which you say that something is true all of the time when it is only true some of the time",
    "example": "The report is full of errors and sweeping generalizations."
  },
  {
    "word": "dawn",
    "pos": "n.",
    "meaning_cn": "开端，曙光，萌芽",
    "definition": "the beginning or first signs of something",
    "example": "Peace marked a new dawn in the country's history."
  },
  {
    "word": "fauna",
    "pos": "n.",
    "meaning_cn": "（某地区或某时期的）动物群",
    "definition": "all the animals living in an area or in a particular period of history",
    "example": ""
  },
  {
    "word": "flora",
    "pos": "n.",
    "meaning_cn": "（某地区、环境或时期的）植物群",
    "definition": "the plants of a particular area, type of environment or period of time",
    "example": "We have to protect the local flora and fauna."
  },
  {
    "word": "appreciate",
    "pos": "vt.",
    "meaning_cn": "理解，意识到，领会",
    "definition": "to understand that something is true",
    "example": "What I failed to appreciate was the distance between the two cities."
  },
  {
    "word": "at one's disposal",
    "pos": "phrase",
    "meaning_cn": "任某人处理，供某人任意使用，由某人自行支配",
    "definition": "available for use as you prefer",
    "example": "He will have a car at his disposal for the whole month."
  },
  {
    "word": "mythic",
    "pos": "adj.",
    "meaning_cn": "著名的，神话般的",
    "definition": "that has become very famous, like someone or something in a myth",
    "example": "Scott of the Antarctic was a national hero of mythic proportions."
  },
  {
    "word": "hound",
    "pos": "vt.",
    "meaning_cn": "追踪，追逐，纠缠",
    "definition": "to keep following someone and not leave them alone, especially to get something from them or ask them questions",
    "example": "They were hounded day and night by the press."
  },
  {
    "word": "mock",
    "pos": "vt.",
    "meaning_cn": "不尊重，蔑视",
    "definition": "to show no respect for something",
    "example": "The new exam mocked the needs of the majority of children."
  },
  {
    "word": "deity",
    "pos": "n.",
    "meaning_cn": "神",
    "definition": "a god or goddess",
    "example": "Ares and Aphrodite were the ancient Greek deities of war and love."
  },
  {
    "word": "offspring",
    "pos": "n.",
    "meaning_cn": "产物，结果，后代",
    "definition": "the product or result of something",
    "example": "German nationalism was the offspring of military ambition."
  },
  {
    "word": "whopping",
    "pos": "adj.",
    "meaning_cn": "极大的",
    "definition": "extremely large",
    "example": "She had a whopping great bruise on her arm."
  },
  {
    "word": "steer",
    "pos": "vt.",
    "meaning_cn": "引导，带领",
    "definition": "to take someone or something or make someone or something go in the direction in which you want them to go",
    "example": "I'd like to steer our discussion back to our original topic."
  },
  {
    "word": "vicinity",
    "pos": "n.",
    "meaning_cn": "邻近地区，附近",
    "definition": "the area around a place or where the speaker is",
    "example": "There are several hotels in the immediate vicinity of the station."
  },
  {
    "word": "succumb",
    "pos": "vi.",
    "meaning_cn": "屈从，屈服",
    "definition": "to lose the determination to oppose something; to accept defeat",
    "example": "I felt sure it would only be a matter of time before he succumbed to my charms."
  },
  {
    "word": "militia",
    "pos": "n.",
    "meaning_cn": "（有别于职业军队的）民兵部队",
    "definition": "a military force whose members are trained soldiers but who often have other jobs",
    "example": "A UN force was sent in to stop fighting between three rival militias."
  },
  {
    "word": "decent",
    "pos": "adj.",
    "meaning_cn": "过得去的，合意的，舒适的，满意的",
    "definition": "of an acceptable standard; satisfactory",
    "example": "Everyone should be entitled to a decent wage/standard of living."
  },
  {
    "word": "folklore",
    "pos": "n.",
    "meaning_cn": "民间传说，民俗",
    "definition": "the traditional stories and culture of a group of people",
    "example": "Her books are often based on folklore and fairy-tales."
  },
  {
    "word": "downplay",
    "pos": "vt.",
    "meaning_cn": "对…轻描淡写，淡化，低估",
    "definition": "make something appear less important than it really is",
    "example": "This report downplays the seriousness of global warming."
  },
  {
    "word": "mutual",
    "pos": "adj.",
    "meaning_cn": "相互的，彼此的",
    "definition": "used to describe feelings that two or more people have for each other equally, or actions that affect two or more people equally",
    "example": "I don't like her, and I think the feeling is mutual."
  },
  {
    "word": "distraction",
    "pos": "n.",
    "meaning_cn": "分散注意力的事，使人分心的事",
    "definition": "a thing that takes your attention away from what you are doing or thinking about",
    "example": "I find it hard to work at home because there are too many distractions."
  },
  {
    "word": "egg sb on",
    "pos": "phrase",
    "meaning_cn": "怂恿，鼓动，煽动",
    "definition": "to strongly encourage someone to do something that might not be a very good idea",
    "example": "Don't egg him on! He gets himself into enough trouble without your encouragement."
  },
  {
    "word": "sporadic",
    "pos": "adj.",
    "meaning_cn": "偶尔发生的，间或出现的，阵发性的，断断续续的",
    "definition": "happening only occasionally or at intervals that are not regular",
    "example": "More than 100 people have been killed this year in sporadic outbursts of ethnic violence."
  },
  {
    "word": "repudiate",
    "pos": "vt.",
    "meaning_cn": "拒绝，不接受",
    "definition": "to refuse to accept something or someone as true, good, or reasonable",
    "example": "He repudiated the allegation that he had tried to deceive them."
  },
  {
    "word": "strenuous",
    "pos": "adj.",
    "meaning_cn": "费劲的，费力的",
    "definition": "requiring or using great exertion",
    "example": "The government made strenuous efforts to upgrade the quality of the teaching profession."
  },
  {
    "word": "prescribe",
    "pos": "vt.",
    "meaning_cn": "规定，命令，指示",
    "definition": "to say what should be done or how something should be done",
    "example": "The prescribed form must be completed and returned to this office."
  },
  {
    "word": "garment",
    "pos": "n.",
    "meaning_cn": "衣服（尤用于衣服生产和销售的领域）",
    "definition": "a piece of clothing; used especially in contexts where you are talking about the manufacture or sale of clothes",
    "example": "Many of the garments have the customers' name tags sewn into the linings."
  },
  {
    "word": "account for",
    "pos": "phrase",
    "meaning_cn": "解释",
    "definition": "to explain the reason for something or the cause of something",
    "example": "Rural Americans are often older than those in other parts of America and that may account for the slower adoption rates for internet access."
  },
  {
    "word": "hamper",
    "pos": "vt.",
    "meaning_cn": "阻碍，妨碍",
    "definition": "to prevent someone doing something easily",
    "example": "Fierce storms have been hampering rescue efforts and there is now little chance of finding more survivors."
  },
  {
    "word": "attest",
    "pos": "vt. & vi.",
    "meaning_cn": "表明，证明，证实",
    "definition": "to show something or to say or prove that something is true",
    "example": "The number of old German cars still on the road attests to the excellence of their manufacture."
  }
]