[
  {
    "word": "preserve",
    "pos": "vt.",
    "meaning_cn": "保护，维护",
    "definition": "to keep something as it is, especially to prevent it from decaying or being damaged",
    "example": "I need to get out of the house from time to time just to preserve my sanity."
  },
  {
    "word": "revere",
    "pos": "vt.",
    "meaning_cn": "尊敬，崇敬",
    "definition": "to very much respect and admire someone or something",
    "example": "Nelson Mandela is revered for his brave fight against apartheid."
  },
  {
    "word": "quest",
    "pos": "n.",
    "meaning_cn": "探索，寻求，追求",
    "definition": "a long search for something difficult to find, or an attempt to achieve something difficult",
    "example": "She does aerobics four times a week in her quest to achieve the perfect body."
  },
  {
    "word": "laden",
    "pos": "adj.",
    "meaning_cn": "装满的，载满的",
    "definition": "carrying or holding a lot of something",
    "example": "He always comes back from France laden with presents for everyone."
  },
  {
    "word": "delegate",
    "pos": "vt. & vi.",
    "meaning_cn": "委派，委托，授权",
    "definition": "to give a particular job, duty, right, etc. to someone else so that they do it for you",
    "example": "As a boss you have to delegate responsibilities to your staff."
  },
  {
    "word": "hyperbolic",
    "pos": "adj.",
    "meaning_cn": "夸张的",
    "definition": "relating to a way of speaking or writing that makes someone or something sound bigger, better, more, etc., than they are",
    "example": "It was not a hyperbolic expression to call it the worst storm in twenty years."
  },
  {
    "word": "considerate",
    "pos": "adj.",
    "meaning_cn": "体贴的，体谅的，考虑周到的",
    "definition": "careful not to cause inconvenience or hurt to others",
    "example": "Motorists should be aware of cyclists and considerate towards them."
  },
  {
    "word": "considerable",
    "pos": "adj.",
    "meaning_cn": "相当大的，相当多的，相当重要的",
    "definition": "notably large in size, amount, or extent",
    "example": "The fire caused considerable damage to the church."
  },
  {
    "word": "porous",
    "pos": "adj.",
    "meaning_cn": "（岩石或其他材料）有孔的，多孔的",
    "definition": "having minute interstices through which liquid or air may pass",
    "example": "He added sand to the soil to make it more porous."
  },
  {
    "word": "capacity",
    "pos": "n.",
    "meaning_cn": "身份，角色，职位",
    "definition": "a specified role or position",
    "example": "She was speaking in her capacity as a novelist, rather than as a television presenter."
  },
  {
    "word": "overt",
    "pos": "adj.",
    "meaning_cn": "公开的，明显的",
    "definition": "done or shown openly; plainly or readily apparent, not secret or hidden",
    "example": "He shows no overt signs of his unhappiness."
  },
  {
    "word": "at odds with",
    "pos": "phrase",
    "meaning_cn": "与...相抵触、不一致",
    "definition": "in disagreement",
    "example": "His behavior is clearly at odds with what the college expects from its students."
  },
  {
    "word": "depart from",
    "pos": "phrase",
    "meaning_cn": "脱离，背离，偏离",
    "definition": "to be different from the usual or expected way of doing or thinking about something",
    "example": "At this point in the speech, the minister departed from his prepared text."
  },
  {
    "word": "in conjunction with",
    "pos": "phrase",
    "meaning_cn": "和……一起",
    "definition": "in combination with; together with",
    "example": "The medicine is typically used in conjunction with other treatments."
  },
  {
    "word": "glide",
    "pos": "vi.",
    "meaning_cn": "滑行，滑动，掠过",
    "definition": "to move smoothly and quietly, especially as though it takes no effort",
    "example": "Swans went gliding past."
  },
  {
    "word": "hibernate",
    "pos": "vi.",
    "meaning_cn": "冬眠，蛰伏",
    "definition": "to spend the winter in a state like deep sleep",
    "example": "Dormice hibernate from October to May."
  },
  {
    "word": "fungus",
    "pos": "n.",
    "meaning_cn": "真菌（复数形式为fungi）",
    "definition": "any plant without leaves, flowers or green colouring, usually growing on other plants or on decaying matter",
    "example": "A fungus is a plant that has no flowers, leaves, or green colouring, such as a mushroom or a toadstool."
  },
  {
    "word": "peninsula",
    "pos": "n.",
    "meaning_cn": "半岛",
    "definition": "a piece of land almost surrounded by water or projecting out into a body of water",
    "example": "The Arab live on the Arabian Peninsula."
  },
  {
    "word": "undertake",
    "pos": "vt.",
    "meaning_cn": "承担，从事",
    "definition": "to make yourself responsible for something and start doing it",
    "example": "The company has announced that it will undertake a full investigation into the accident."
  },
  {
    "word": "boost",
    "pos": "vt.",
    "meaning_cn": "改善，提高",
    "definition": "to improve or increase something",
    "example": "I tried to boost his ego by praising his cooking."
  },
  {
    "word": "painstaking",
    "pos": "adj.",
    "meaning_cn": "刻苦的，下苦功的",
    "definition": "done with or employing great care and thoroughness",
    "example": "It took months of painstaking research to write the book."
  },
  {
    "word": "hinder",
    "pos": "vt.",
    "meaning_cn": "阻碍",
    "definition": "to make it difficult for someone to do something or for something to develop",
    "example": "Their journey was hindered by snow and high winds."
  },
  {
    "word": "supplement",
    "pos": "vt.",
    "meaning_cn": "增补，补充",
    "definition": "add an extra element or amount to",
    "example": "She took the job to supplement her husband's income."
  },
  {
    "word": "feasible",
    "pos": "adj.",
    "meaning_cn": "可行的",
    "definition": "possible to do",
    "example": "This plan for a new town library is not economically feasible."
  },
  {
    "word": "celebrated",
    "pos": "adj.",
    "meaning_cn": "著名的",
    "definition": "known and praised by many people",
    "example": "He is one of today's most celebrated young writers."
  },
  {
    "word": "avid",
    "pos": "adj.",
    "meaning_cn": "热心的，热衷的",
    "definition": "having or showing a keen interest in or enthusiasm for something",
    "example": "She took an avid interest in the project."
  },
  {
    "word": "vertical",
    "pos": "adj.",
    "meaning_cn": "竖直的",
    "definition": "at right angles to a horizontal plane",
    "example": "She looked over the cliff and found she was standing at the edge of a vertical drop."
  },
  {
    "word": "horizontal",
    "pos": "adj.",
    "meaning_cn": "水平的",
    "definition": "parallel to the plane of the horizon",
    "example": "Keep the patient horizontal with the feet slightly raised."
  },
  {
    "word": "equivalent",
    "pos": "adj.",
    "meaning_cn": "（价值、数量、功能、意义等）等同的",
    "definition": "equal in value, amount, function, meaning, etc.",
    "example": "Those less-known companies manufacture equivalent products at cheaper prices."
  },
  {
    "word": "resonate",
    "pos": "vi.",
    "meaning_cn": "充满，弥漫（某种特质）；引起共鸣",
    "definition": "1. to be filled with a particular quality; 2. If an experience or memory resonates, it makes you think of another similar one.",
    "example": "Her experiences resonate powerfully with me, living, as I do, in a similar family situation."
  },
  {
    "word": "draw on",
    "pos": "phrase",
    "meaning_cn": "利用",
    "definition": "to use information or your knowledge of something to help you do something",
    "example": "His novels draw heavily on his childhood."
  },
  {
    "word": "inhospitable",
    "pos": "adj.",
    "meaning_cn": "难以居住的，条件恶劣的",
    "definition": "not suitable for humans to live in",
    "example": "They had to trek for miles through inhospitable countryside."
  },
  {
    "word": "burgeoning",
    "pos": "adj.",
    "meaning_cn": "迅速发展的",
    "definition": "developing quickly",
    "example": "The company hoped to profit from the burgeoning communications industry."
  },
  {
    "word": "fuse",
    "pos": "vt. & vi.",
    "meaning_cn": "（使）熔合，结合",
    "definition": "to join or become combined",
    "example": "Genes determine how we develop from the moment the sperm fuses with the egg."
  },
  {
    "word": "infuse",
    "pos": "vt.",
    "meaning_cn": "注入，使充满",
    "definition": "to fill someone or something with an emotion or quality",
    "example": "The pulling down of the Berlin Wall infused the world with optimism."
  },
  {
    "word": "resilient",
    "pos": "adj.",
    "meaning_cn": "有弹性的，有复原力的，适应性强的",
    "definition": "able to quickly return to a previous good condition",
    "example": "She's a resilient girl - she won't be unhappy for long."
  },
  {
    "word": "hostile",
    "pos": "adj.",
    "meaning_cn": "艰苦的，恶劣的，不利的",
    "definition": "difficult or not suitable for living or growing",
    "example": "Sales increased last year despite the hostile economic environment."
  },
  {
    "word": "replenish",
    "pos": "vt.",
    "meaning_cn": "补充，重新装满",
    "definition": "to fill something up again",
    "example": "Food stocks were replenished by imports from abroad."
  },
  {
    "word": "insulation",
    "pos": "n.",
    "meaning_cn": "隔热，隔音，绝缘",
    "definition": "the act of covering something to stop heat, sound, or electricity from escaping or entering",
    "example": "The animal's thick fur provides very good insulation against the arctic cold."
  },
  {
    "word": "spur",
    "pos": "vt.",
    "meaning_cn": "激励，鞭策，促进，加速",
    "definition": "to encourage an activity or development or make it happen faster",
    "example": "Rising consumer sales have the effect of spurring the economy to faster growth."
  },
  {
    "word": "rear",
    "pos": "vt. & adj.",
    "meaning_cn": "养育，抚养，饲养；后面的，后部的",
    "definition": "1. to care for young animals or children until they are able to care for themselves; 2. at or near the back of something",
    "example": "He describes how these birds rear their young."
  },
  {
    "word": "influx",
    "pos": "n.",
    "meaning_cn": "大量人或物的涌入",
    "definition": "an arrival or entry of large numbers of people or things",
    "example": "Turkey is expecting an influx of several thousand refugees over the next few days."
  },
  {
    "word": "pressing",
    "pos": "adj.",
    "meaning_cn": "紧迫的，急迫的，迫切的",
    "definition": "urgent, requiring quick or immediate action or attention",
    "example": "Inflation was the most pressing problem."
  },
  {
    "word": "convert",
    "pos": "vt.",
    "meaning_cn": "使（形态、性质、功能）转变，改变",
    "definition": "cause to change in form, character, or function",
    "example": "Could we convert the small bedroom into a second bathroom?"
  }
]