[
  {
    "word": "subject",
    "pos": "n., adj., vt.",
    "meaning_cn": "国民，臣民；可能受影响的；使臣服",
    "definition": "1. a person who has the right to belong to a particular country, especially one with a king or queen; 2. likely to be affected by sth, especially sth bad; 3. to bring a country or group of people under your control, especially by using force",
    "example": "Flights are subject to delay because of the fog."
  },
  {
    "word": "foretell",
    "pos": "vt.",
    "meaning_cn": "预言",
    "definition": "to say what is going to happen in the future",
    "example": "He was a 16th-century prophet who foretold how the world would end."
  },
  {
    "word": "the lion's share",
    "pos": "phrase",
    "meaning_cn": "最大份额，大部分",
    "definition": "the largest part or most of something",
    "example": "Reputable charities spend the lion's share of donations on aid and a tiny fraction on administration."
  },
  {
    "word": "impede",
    "pos": "vt.",
    "meaning_cn": "妨碍，阻止",
    "definition": "to delay or stop the progress of something",
    "example": "Work on the building was impeded by severe weather."
  },
  {
    "word": "refined",
    "pos": "adj.",
    "meaning_cn": "精炼的，提纯的；有礼貌的，优雅的，有教养的",
    "definition": "(of a substance) made pure by having other substances taken out of it; polite, well educated and able to judge the quality of things; having the sort of manners that are considered typical of a high social class",
    "example": "The hotel lobby reflects the refined taste of the owners."
  },
  {
    "word": "embankment",
    "pos": "n.",
    "meaning_cn": "堤岸",
    "definition": "an artificial slope made of earth and/or stones",
    "example": "There is a river/road/railway embankment."
  },
  {
    "word": "landfill",
    "pos": "n.",
    "meaning_cn": "垃圾填埋，垃圾填埋场",
    "definition": "the process of getting rid of large amounts of rubbish by burying it, or a place where rubbish is buried",
    "example": "90 percent of American rubbish is dumped in landfill sites."
  },
  {
    "word": "stitch",
    "pos": "vt.",
    "meaning_cn": "缝，缝补",
    "definition": "to use a needle and thread to repair, join, or decorate pieces of cloth",
    "example": "Her wedding dress was stitched by hand."
  },
  {
    "word": "debris",
    "pos": "n.",
    "meaning_cn": "碎片，残片",
    "definition": "broken or torn pieces of something larger",
    "example": "Debris from the aircraft was scattered over a large area."
  },
  {
    "word": "remnant",
    "pos": "n.",
    "meaning_cn": "剩余物",
    "definition": "a small remaining quantity of something",
    "example": "Even today remnants of this practice remain."
  },
  {
    "word": "scatter",
    "pos": "vt.",
    "meaning_cn": "撒，撒播",
    "definition": "to throw or drop things in different directions so that they cover an area of ground",
    "example": "Scatter the lawn with grass seed."
  },
  {
    "word": "intermediate",
    "pos": "adj.",
    "meaning_cn": "（两地、两物、两种状态等）之间的，中间的",
    "definition": "located between two places, things, states, etc.",
    "example": "Liquid crystals are considered to be intermediate between liquid and solid."
  },
  {
    "word": "momentum",
    "pos": "n.",
    "meaning_cn": "动力，势头",
    "definition": "the impetus and driving force gained by the development of a process or course of events",
    "example": "The play loses momentum by its halfway stage."
  },
  {
    "word": "myriad",
    "pos": "n.",
    "meaning_cn": "无数，极大数量",
    "definition": "a countless or extremely great number",
    "example": "Myriads of insects danced around the light above my head."
  },
  {
    "word": "embark",
    "pos": "vi.",
    "meaning_cn": "着手，开始从事（尤指重要或费力的事）",
    "definition": "begin (a course of action, especially one which is important or demanding)",
    "example": "He embarked on a new career."
  },
  {
    "word": "recipe",
    "pos": "n.",
    "meaning_cn": "食谱，烹饪法",
    "definition": "a set of instructions telling you how to prepare and cook food, including a list of what food is needed for this",
    "example": "Baking a cake isn't difficult — it's just a matter of following the recipe."
  },
  {
    "word": "encompass",
    "pos": "vt.",
    "meaning_cn": "包含，包括（尤指很多不同事物）",
    "definition": "include different types of things",
    "example": "The festival is to encompass everything from music, theatre, and ballet to literature, cinema, and the visual arts."
  },
  {
    "word": "undergo",
    "pos": "vt.",
    "meaning_cn": "经历，经受（令人不快的事或变化）",
    "definition": "to experience something that is unpleasant or something that involves a change",
    "example": "She underwent an operation on a tumour in her left lung last year."
  },
  {
    "word": "assimilate",
    "pos": "vt. & vi.",
    "meaning_cn": "（使）加入，融入",
    "definition": "to become part of a group, country, society, etc., or to make someone or something become part of a group, country, society, etc.",
    "example": "You shouldn't expect immigrants to assimilate into an alien culture immediately."
  },
  {
    "word": "uncanny",
    "pos": "adj.",
    "meaning_cn": "奇怪的，神秘的，难以解释的",
    "definition": "strange or mysterious; difficult or impossible to explain",
    "example": "He has an uncanny ability to guess what you're thinking."
  },
  {
    "word": "posit",
    "pos": "vt.",
    "meaning_cn": "假设，设想；把某事建立在（某个前设）上",
    "definition": "1. to suggest something as a basic fact or principle from which a further idea is formed or developed; 2. base something on the truth of (a particular assumption)",
    "example": "If we posit that wage rises cause inflation, it follows that we should try to minimize them."
  },
  {
    "word": "nuisance",
    "pos": "n.",
    "meaning_cn": "恼人的事物（或人）",
    "definition": "something or someone that annoys you or causes trouble for you",
    "example": "I've forgotten my umbrella - what a nuisance!"
  },
  {
    "word": "worn out",
    "pos": "adj.",
    "meaning_cn": "精疲力尽的",
    "definition": "extremely tired",
    "example": "I've been working all night and I'm worn out."
  },
  {
    "word": "pitfall",
    "pos": "n.",
    "meaning_cn": "隐患，陷阱",
    "definition": "a likely mistake or problem in a situation",
    "example": "The store fell into one of the major pitfalls of small business, borrowing from suppliers by paying bills late."
  },
  {
    "word": "deviate",
    "pos": "vi.",
    "meaning_cn": "出格，违背规则",
    "definition": "to do something that is different from the usual or common way of behaving",
    "example": "The recent pattern of weather deviates from the norm for this time of year."
  },
  {
    "word": "aesthetic",
    "pos": "adj.",
    "meaning_cn": "美感的，审美的，美学的",
    "definition": "relating to the enjoyment or study of beauty",
    "example": "The new building has little aesthetic value/appeal."
  },
  {
    "word": "advent",
    "pos": "n.",
    "meaning_cn": "来临，到来",
    "definition": "the fact of an event happening, an invention being made, or a person arriving",
    "example": "Life was transformed by the advent of the steam engine."
  },
  {
    "word": "bloom",
    "pos": "vi.",
    "meaning_cn": "繁荣，兴盛",
    "definition": "to grow or develop successfully",
    "example": "Rimbaud's poetic genius bloomed early."
  },
  {
    "word": "versatile",
    "pos": "adj.",
    "meaning_cn": "多功能的，多才多艺的",
    "definition": "able to adapt or be adapted to many different functions or activities",
    "example": "He was versatile enough to play on either wing."
  },
  {
    "word": "loathe",
    "pos": "vt.",
    "meaning_cn": "憎恨，厌恶",
    "definition": "to hate someone or something",
    "example": "From an early age the brothers have loathed each other."
  },
  {
    "word": "proponent",
    "pos": "n.",
    "meaning_cn": "提倡者，支持者",
    "definition": "a person who speaks publicly in support of a particular idea or plan of action",
    "example": "He is one of the leading proponents of capital punishment."
  },
  {
    "word": "align yourself with",
    "pos": "phrase",
    "meaning_cn": "与...保持一致，与...结盟",
    "definition": "If you align yourself with an organization or person, you agree with and support their aims.",
    "example": "The major unions are aligned with the government on this issue."
  },
  {
    "word": "jarring",
    "pos": "adj.",
    "meaning_cn": "（使）感到不快的，刺激（神经等）的",
    "definition": "a jarring sight, sound, or experience is so different or unexpected that it has a strong and unpleasant effect on something or someone",
    "example": "That was a jarring experience."
  },
  {
    "word": "linger",
    "pos": "vi.",
    "meaning_cn": "停留，逗留，徘徊",
    "definition": "to take a long time to leave or disappear",
    "example": "After the play had finished, we lingered for a while in the bar hoping to catch sight of the actors."
  },
  {
    "word": "stem from",
    "pos": "phrase",
    "meaning_cn": "源自，由...造成",
    "definition": "to start or develop as the result of something",
    "example": "Their disagreement stemmed from a misunderstanding."
  },
  {
    "word": "arduous",
    "pos": "adj.",
    "meaning_cn": "艰难的，费力的",
    "definition": "difficult, needing a lot of effort and energy",
    "example": "In those days, long-distance travel was slow and arduous."
  },
  {
    "word": "impart",
    "pos": "vt.",
    "meaning_cn": "赋予，给予",
    "definition": "to give something a particular feeling, quality, or taste",
    "example": "Preservatives can impart colour and flavour to a product."
  },
  {
    "word": "mural",
    "pos": "n.",
    "meaning_cn": "壁画",
    "definition": "a painting that is painted on a wall, either inside or outside a building",
    "example": "We found a mural 72 feet long and 7 feet tall there."
  },
  {
    "word": "confide in sb",
    "pos": "phrase",
    "meaning_cn": "向……倾诉，向……吐露情感（或秘密）",
    "definition": "to tell something secret or personal to someone who you trust not to tell anyone else",
    "example": "She's nice, but I don't feel I can confide in her."
  },
  {
    "word": "on top of sth",
    "pos": "phrase",
    "meaning_cn": "除（尤指令人不快之事）之外（还）",
    "definition": "in addition to something, especially something unpleasant",
    "example": "We missed our flight, and on top of that we had to wait seven hours for the next one."
  },
  {
    "word": "offset",
    "pos": "vt.",
    "meaning_cn": "补偿，抵消，弥补",
    "definition": "to balance one influence against an opposing influence, so that there is no great difference as a result",
    "example": "The extra cost of travelling to work is offset by the lower price of houses here."
  },
  {
    "word": "projection",
    "pos": "n.",
    "meaning_cn": "不自觉地把自己的欲念等加诸他人；推断；凸出物",
    "definition": "1. the unconscious transfer of one's own desires or emotions to another person; 2. an estimate or a statement of what figures, amounts, or events will be in the future; 3. something that sticks out from a surface",
    "example": "Sales have exceeded our projections."
  },
  {
    "word": "overwhelming",
    "pos": "adj.",
    "meaning_cn": "难以抵挡的，无法抗拒的",
    "definition": "difficult to fight against",
    "example": "She felt an overwhelming urge to tell someone about what had happened."
  },
  {
    "word": "ornate",
    "pos": "adj.",
    "meaning_cn": "装饰华丽的，装饰繁复的",
    "definition": "having a lot of complicated decoration",
    "example": "The luxurious dress, ornate chair and intimate setting reflect the rococo spirit of the period."
  }
]